
## Terraform plan for environment: `dev`

**Commit:** d880d901ac07e504fafa53d2e3c164b984a211fd


**API version:** 790df66870
**CLI version:** 790df66870
**Selfserve version:** 790df66870
**Internal version:** 790df66870

### Plan summary

`4 to add, 1 to change, 1 to destroy`

**🆕 Creates**

```tf
module.service.module.sqs_deadletter.aws_sqs_queue.dlq[0]
module.service.module.sqs_deadletter.aws_sqs_queue.this[0]
module.service.module.sqs_deadletter.aws_sqs_queue_redrive_allow_policy.dlq[0]
module.service.module.sqs_deadletter.aws_sqs_queue_redrive_policy.dlq[0]
```
**🗑️ Deletes**

```tf
module.service.aws_sqs_queue.sqs-deadletter-queue
```
**🔄 Updates**

```tf
module.service.module.eventbridge_sns.aws_cloudwatch_event_target.this["batch-fail-event"]
```


----

<details data-gh-workflow="dev-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.service.aws_sqs_queue.sqs-deadletter-queue will be destroyed
  # (because aws_sqs_queue.sqs-deadletter-queue is not in configuration)
  - resource "aws_sqs_queue" "sqs-deadletter-queue" {
      - arn                               = "arn:aws:sqs:eu-west-1:054614622558:vol-app-dev-batch-failure-dlq" -> null
      - content_based_deduplication       = false -> null
      - delay_seconds                     = 0 -> null
      - fifo_queue                        = false -> null
      - id                                = "https://sqs.eu-west-1.amazonaws.com/054614622558/vol-app-dev-batch-failure-dlq" -> null
      - kms_data_key_reuse_period_seconds = 300 -> null
      - max_message_size                  = 262144 -> null
      - message_retention_seconds         = 345600 -> null
      - name                              = "vol-app-dev-batch-failure-dlq" -> null
      - receive_wait_time_seconds         = 0 -> null
      - sqs_managed_sse_enabled           = true -> null
      - tags_all                          = {
          - "Environment" = "dev"
          - "Repository"  = "https://github.com/dvsa/vol-app"
        } -> null
      - url                               = "https://sqs.eu-west-1.amazonaws.com/054614622558/vol-app-dev-batch-failure-dlq" -> null
      - visibility_timeout_seconds        = 30 -> null
        # (7 unchanged attributes hidden)
    }

  # module.service.module.eventbridge_sns.aws_cloudwatch_event_target.this["batch-fail-event"] will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "this" {
        id             = "vol-app-dev-batch-failure-event-rule-terraform-20241009140628712300000001"
        # (8 unchanged attributes hidden)

      ~ dead_letter_config (known after apply)
      - dead_letter_config {
          - arn = "arn:aws:sqs:eu-west-1:054614622558:vol-app-dev-batch-failure-dlq" -> null
        }
    }

  # module.service.module.sqs_deadletter.aws_sqs_queue.dlq[0] will be created
  + resource "aws_sqs_queue" "dlq" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "vol-app-dev-batch-failure-dlq-dlq"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags_all                          = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.service.module.sqs_deadletter.aws_sqs_queue.this[0] will be created
  + resource "aws_sqs_queue" "this" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "vol-app-dev-batch-failure-dlq"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags_all                          = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.service.module.sqs_deadletter.aws_sqs_queue_redrive_allow_policy.dlq[0] will be created
  + resource "aws_sqs_queue_redrive_allow_policy" "dlq" {
      + id                   = (known after apply)
      + queue_url            = (known after apply)
      + redrive_allow_policy = (known after apply)
    }

  # module.service.module.sqs_deadletter.aws_sqs_queue_redrive_policy.dlq[0] will be created
  + resource "aws_sqs_queue_redrive_policy" "dlq" {
      + id             = (known after apply)
      + queue_url      = (known after apply)
      + redrive_policy = (known after apply)
    }

Plan: 4 to add, 1 to change, 1 to destroy.

```

</details>